explain select * from Emp where ename like '김%' and dept = 2;

explain select * from Emp where id > 0 and ename = '';

explain select * from Emp where ename like '%김%' and dept = 2;

explain select * from Emp where substring(ename, 2) = '신신';
select substring(ename,-1) from Emp;
show index from Emp;

use schooldb;
select substring(mobile, -4) from Student;
alter table Student add index (
    (substring(mobile, -4))
);

explain select * from Student where substring(mobile, -4) = '1012';

select * from Student s where exists(select * from Student where major > s.major);

show variables like 'innodb_ft%';

use testdb;
create table StopWord(
    value varchar(31) not null
);

insert into StopWord(value) values ('가까스로'), ('가령'), ('각각'), ('각자'), ('각종'), ('갖고말하자면'), ('같다'), ('같이'), ('개의치않고'), ('거니와'), ('거바'), ('거의'), ('것과'), ('것들'), ('게다가'), ('게우다'), ('겨우'), ('견지에서'), ('이르다'), ('있다'), ('겸사겸사'), ('고려하면'), ('고로'), ('공동으로'), ('과연'), ('관계없이'), ('관련이'), ('관하여'), ('관한'), ('관해서는'), ('구체적으로'), ('구토하다'), ('그들'), ('그때'), ('그래'), ('그래도'), ('그래서'), ('그러나'), ('그러니'), ('그러니까'), ('그러면'), ('그러므로'), ('그러한즉'), ('그런'), ('까닭에'), ('그런데'), ('그런즉'), ('그럼'), ('그럼에도불구하고'), ('그렇게'), ('함으로써'), ('그렇지'), ('않다면'), ('않으면'), ('그렇지만'), ('그렇지않으면'), ('그리고'), ('그리하여'), ('그만이다'), ('그에'), ('따르는'), ('그위에'), ('그저'), ('그중에서'), ('그치지'), ('않다'), ('근거로'), ('근거하여'), ('기대여'), ('기점으로'), ('기준으로'), ('기타'), ('까닭으로'), ('까악'), ('까지'), ('미치다'), ('까지도'), ('꽈당'), ('끙끙'), ('끼익'), ('나머지는'), ('남들'), ('남짓'), ('너희'), ('너희들'), ('논하지'), ('놀라다'), ('누가'), ('알겠는가'), ('누구'), ('다른'), ('방면으로'), ('다만'), ('다섯'), ('다소'), ('다수'), ('다시'), ('말하자면'), ('다시말하면'), ('다음'), ('다음에'), ('다음으로'), ('단지'), ('답다'), ('당신'), ('당장'), ('대로'), ('하다'), ('대하면'), ('대하여'), ('대해'), ('대해서'), ('댕그'), ('더구나'), ('더군다나'), ('더라도'), ('더불어'), ('더욱더'), ('더욱이는'), ('도달하다'), ('도착하다'), ('동시에'), ('동안'), ('된바에야'), ('된이상'), ('두번째로'), ('둥둥'), ('뒤따라'), ('뒤이어'), ('든간에'), ('등등'), ('딩동'), ('따라'), ('따라서'), ('따위'), ('따지지'), ('때가'), ('되어'), ('때문에'), ('또한'), ('뚝뚝'), ('해도'), ('인하여'), ('로부터'), ('로써'), ('마음대로'), ('마저'), ('마저도'), ('마치'), ('막론하고'), ('못하다'), ('만약'), ('만약에'), ('만은'), ('아니다'), ('만이'), ('만일'), ('만큼'), ('말할것도'), ('없고'), ('매번'), ('메쓰겁다'), ('모두'), ('무렵'), ('무릎쓰고'), ('무슨'), ('무엇'), ('무엇때문에'), ('물론'), ('바꾸어말하면'), ('바꾸어말하자면'), ('바꾸어서'), ('말하면'), ('한다면'), ('바꿔'), ('바로'), ('바와같이'), ('밖에'), ('안된다'), ('반대로'), ('반드시'), ('버금'), ('보는데서'), ('보다더'), ('보드득'), ('본대로'), ('봐라'), ('부류의'), ('사람들'), ('부터'), ('불구하고'), ('불문하고'), ('붕붕'), ('비걱거리다'), ('비교적'), ('비길수'), ('없다'), ('비로소'), ('비록'), ('비슷하다'), ('비추어'), ('보아'), ('비하면'), ('뿐만'), ('아니라'), ('뿐만아니라'), ('뿐이다'), ('삐걱'), ('삐걱거리다'), ('상대적으로'), ('생각한대로'), ('설령'), ('설마'), ('설사'), ('소생'), ('소인'), ('습니까'), ('습니다'), ('시각'), ('시간'), ('시작하여'), ('시초에'), ('시키다'), ('실로'), ('심지어'), ('아니'), ('아니나다를가'), ('아니라면'), ('아니면'), ('아니었다면'), ('아래윗'), ('아무거나'), ('아무도'), ('아야'), ('아울러'), ('아이'), ('아이고'), ('아이구'), ('아이야'), ('아이쿠'), ('아하'), ('아홉'), ('않기'), ('위하여'), ('위해서'), ('알았어'), ('앞에서'), ('앞의것'), ('약간'), ('양자'), ('어기여차'), ('어느'), ('년도'), ('어느것'), ('어느곳'), ('어느때'), ('어느쪽'), ('어느해'), ('어디'), ('어때'), ('어떠한'), ('어떤'), ('어떤것'), ('어떤것들'), ('어떻게'), ('어떻해'), ('어이'), ('어째서'), ('어쨋든'), ('어쩔수'), ('어찌'), ('어찌됏든'), ('어찌됏어'), ('어찌하든지'), ('어찌하여'), ('언제'), ('언젠가'), ('얼마'), ('되는'), ('얼마간'), ('얼마나'), ('얼마든지'), ('얼마만큼'), ('얼마큼'), ('엉엉'), ('가서'), ('달려'), ('한하다'), ('에게'), ('에서'), ('여기'), ('여덟'), ('여러분'), ('여보시오'), ('여부'), ('여섯'), ('여전히'), ('여차'), ('연관되다'), ('연이서'), ('영차'), ('옆사람'), ('예를'), ('들면'), ('들자면'), ('예컨대'), ('예하면'), ('오로지'), ('오르다'), ('오자마자'), ('오직'), ('오호'), ('오히려'), ('같은'), ('와르르'), ('와아'), ('왜냐하면'), ('외에도'), ('요만큼'), ('요만한'), ('요만한걸'), ('요컨대'), ('우르르'), ('우리'), ('우리들'), ('우선'), ('우에'), ('종합한것과같이'), ('운운'), ('위에서'), ('서술한바와같이'), ('윙윙'), ('으로'), ('으로서'), ('으로써'), ('응당'), ('의거하여'), ('의지하여'), ('의해'), ('의해되다'), ('의해서'), ('되다'), ('외에'), ('정도의'), ('이것'), ('이곳'), ('이때'), ('이라면'), ('이래'), ('이러이러하다'), ('이러한'), ('이런'), ('이럴정도로'), ('이렇게'), ('많은'), ('이렇게되면'), ('이렇게말하자면'), ('이렇구나'), ('이로'), ('이르기까지'), ('이리하여'), ('이만큼'), ('이번'), ('이봐'), ('이상'), ('이어서'), ('이었다'), ('이와'), ('이와같다면'), ('이외에도'), ('이용하여'), ('이유만으로'), ('이젠'), ('이지만'), ('이쪽'), ('이천구'), ('이천육'), ('이천칠'), ('이천팔'), ('듯하다'), ('인젠'), ('일것이다'), ('일곱'), ('일단'), ('일때'), ('일반적으로'), ('일지라도'), ('임에'), ('틀림없다'), ('입각하여'), ('입장에서'), ('잇따라'), ('자기'), ('자기집'), ('자마자'), ('자신'), ('잠깐'), ('잠시'), ('저것'), ('저것만큼'), ('저기'), ('저쪽'), ('저희'), ('전부'), ('전자'), ('전후'), ('점에서'), ('정도에'), ('제각기'), ('제외하고'), ('조금'), ('조차'), ('조차도'), ('졸졸'), ('좋아'), ('좍좍'), ('주룩주룩'), ('주저하지'), ('않고'), ('줄은'), ('몰랏다'), ('줄은모른다'), ('중에서'), ('중의하나'), ('즈음하여'), ('즉시'), ('지든지'), ('지만'), ('지말고'), ('진짜로'), ('쪽으로'), ('차라리'), ('참나'), ('첫번째로'), ('총적으로'), ('보면'), ('콸콸'), ('쾅쾅'), ('타다'), ('타인'), ('탕탕'), ('토하다'), ('통하여'), ('틈타'), ('펄렁'), ('하게될것이다'), ('하게하다'), ('하겠는가'), ('하고'), ('하고있었다'), ('하곤하였다'), ('하구나'), ('하기'), ('하기는한데'), ('하기만'), ('하면'), ('하기보다는'), ('하기에'), ('하나'), ('하느니'), ('하는'), ('김에'), ('편이'), ('낫다'), ('하는것도'), ('하는것만'), ('하는것이'), ('하는바'), ('하더라도'), ('하도다'), ('하도록시키다'), ('하도록하다'), ('하든지'), ('하려고하다'), ('하마터면'), ('할수록'), ('하면된다'), ('하면서'), ('하물며'), ('하여금'), ('하여야'), ('하자마자'), ('하지'), ('않는다면'), ('않도록'), ('하지마'), ('하지마라'), ('하지만'), ('하하'), ('이유는'), ('몰라도'), ('한데'), ('한마디'), ('한적이있다'), ('한켠으로는'), ('한항목'), ('따름이다'), ('생각이다'), ('안다'), ('지경이다'), ('힘이'), ('할때'), ('할만하다'), ('할망정'), ('할뿐'), ('할수있다'), ('할수있어'), ('할줄알다'), ('할지라도'), ('할지언정'), ('함께'), ('해도된다'), ('해도좋다'), ('해봐요'), ('해서는'), ('해야한다'), ('해요'), ('했어요'), ('향하다'), ('향하여'), ('향해서'), ('허걱'), ('허허'), ('헉헉'), ('헐떡헐떡'), ('형식으로'), ('쓰여'), ('혹시'), ('혹은'), ('혼자'), ('훨씬'), ('휘익'), ('흐흐'), ('힘입어');insert into StopWord(value) values ('가까스로'), ('가령'), ('각각'), ('각자'), ('각종'), ('갖고말하자면'), ('같다'), ('같이'), ('개의치않고'), ('거니와'), ('거바'), ('거의'), ('것과'), ('것들'), ('게다가'), ('게우다'), ('겨우'), ('견지에서'), ('이르다'), ('있다'), ('겸사겸사'), ('고려하면'), ('고로'), ('공동으로'), ('과연'), ('관계없이'), ('관련이'), ('관하여'), ('관한'), ('관해서는'), ('구체적으로'), ('구토하다'), ('그들'), ('그때'), ('그래'), ('그래도'), ('그래서'), ('그러나'), ('그러니'), ('그러니까'), ('그러면'), ('그러므로'), ('그러한즉'), ('그런'), ('까닭에'), ('그런데'), ('그런즉'), ('그럼'), ('그럼에도불구하고'), ('그렇게'), ('함으로써'), ('그렇지'), ('않다면'), ('않으면'), ('그렇지만'), ('그렇지않으면'), ('그리고'), ('그리하여'), ('그만이다'), ('그에'), ('따르는'), ('그위에'), ('그저'), ('그중에서'), ('그치지'), ('않다'), ('근거로'), ('근거하여'), ('기대여'), ('기점으로'), ('기준으로'), ('기타'), ('까닭으로'), ('까악'), ('까지'), ('미치다'), ('까지도'), ('꽈당'), ('끙끙'), ('끼익'), ('나머지는'), ('남들'), ('남짓'), ('너희'), ('너희들'), ('논하지'), ('놀라다'), ('누가'), ('알겠는가'), ('누구'), ('다른'), ('방면으로'), ('다만'), ('다섯'), ('다소'), ('다수'), ('다시'), ('말하자면'), ('다시말하면'), ('다음'), ('다음에'), ('다음으로'), ('단지'), ('답다'), ('당신'), ('당장'), ('대로'), ('하다'), ('대하면'), ('대하여'), ('대해'), ('대해서'), ('댕그'), ('더구나'), ('더군다나'), ('더라도'), ('더불어'), ('더욱더'), ('더욱이는'), ('도달하다'), ('도착하다'), ('동시에'), ('동안'), ('된바에야'), ('된이상'), ('두번째로'), ('둥둥'), ('뒤따라'), ('뒤이어'), ('든간에'), ('등등'), ('딩동'), ('따라'), ('따라서'), ('따위'), ('따지지'), ('때가'), ('되어'), ('때문에'), ('또한'), ('뚝뚝'), ('해도'), ('인하여'), ('로부터'), ('로써'), ('마음대로'), ('마저'), ('마저도'), ('마치'), ('막론하고'), ('못하다'), ('만약'), ('만약에'), ('만은'), ('아니다'), ('만이'), ('만일'), ('만큼'), ('말할것도'), ('없고'), ('매번'), ('메쓰겁다'), ('모두'), ('무렵'), ('무릎쓰고'), ('무슨'), ('무엇'), ('무엇때문에'), ('물론'), ('바꾸어말하면'), ('바꾸어말하자면'), ('바꾸어서'), ('말하면'), ('한다면'), ('바꿔'), ('바로'), ('바와같이'), ('밖에'), ('안된다'), ('반대로'), ('반드시'), ('버금'), ('보는데서'), ('보다더'), ('보드득'), ('본대로'), ('봐라'), ('부류의'), ('사람들'), ('부터'), ('불구하고'), ('불문하고'), ('붕붕'), ('비걱거리다'), ('비교적'), ('비길수'), ('없다'), ('비로소'), ('비록'), ('비슷하다'), ('비추어'), ('보아'), ('비하면'), ('뿐만'), ('아니라'), ('뿐만아니라'), ('뿐이다'), ('삐걱'), ('삐걱거리다'), ('상대적으로'), ('생각한대로'), ('설령'), ('설마'), ('설사'), ('소생'), ('소인'), ('습니까'), ('습니다'), ('시각'), ('시간'), ('시작하여'), ('시초에'), ('시키다'), ('실로'), ('심지어'), ('아니'), ('아니나다를가'), ('아니라면'), ('아니면'), ('아니었다면'), ('아래윗'), ('아무거나'), ('아무도'), ('아야'), ('아울러'), ('아이'), ('아이고'), ('아이구'), ('아이야'), ('아이쿠'), ('아하'), ('아홉'), ('않기'), ('위하여'), ('위해서'), ('알았어'), ('앞에서'), ('앞의것'), ('약간'), ('양자'), ('어기여차'), ('어느'), ('년도'), ('어느것'), ('어느곳'), ('어느때'), ('어느쪽'), ('어느해'), ('어디'), ('어때'), ('어떠한'), ('어떤'), ('어떤것'), ('어떤것들'), ('어떻게'), ('어떻해'), ('어이'), ('어째서'), ('어쨋든'), ('어쩔수'), ('어찌'), ('어찌됏든'), ('어찌됏어'), ('어찌하든지'), ('어찌하여'), ('언제'), ('언젠가'), ('얼마'), ('되는'), ('얼마간'), ('얼마나'), ('얼마든지'), ('얼마만큼'), ('얼마큼'), ('엉엉'), ('가서'), ('달려'), ('한하다'), ('에게'), ('에서'), ('여기'), ('여덟'), ('여러분'), ('여보시오'), ('여부'), ('여섯'), ('여전히'), ('여차'), ('연관되다'), ('연이서'), ('영차'), ('옆사람'), ('예를'), ('들면'), ('들자면'), ('예컨대'), ('예하면'), ('오로지'), ('오르다'), ('오자마자'), ('오직'), ('오호'), ('오히려'), ('같은'), ('와르르'), ('와아'), ('왜냐하면'), ('외에도'), ('요만큼'), ('요만한'), ('요만한걸'), ('요컨대'), ('우르르'), ('우리'), ('우리들'), ('우선'), ('우에'), ('종합한것과같이'), ('운운'), ('위에서'), ('서술한바와같이'), ('윙윙'), ('으로'), ('으로서'), ('으로써'), ('응당'), ('의거하여'), ('의지하여'), ('의해'), ('의해되다'), ('의해서'), ('되다'), ('외에'), ('정도의'), ('이것'), ('이곳'), ('이때'), ('이라면'), ('이래'), ('이러이러하다'), ('이러한'), ('이런'), ('이럴정도로'), ('이렇게'), ('많은'), ('이렇게되면'), ('이렇게말하자면'), ('이렇구나'), ('이로'), ('이르기까지'), ('이리하여'), ('이만큼'), ('이번'), ('이봐'), ('이상'), ('이어서'), ('이었다'), ('이와'), ('이와같다면'), ('이외에도'), ('이용하여'), ('이유만으로'), ('이젠'), ('이지만'), ('이쪽'), ('이천구'), ('이천육'), ('이천칠'), ('이천팔'), ('듯하다'), ('인젠'), ('일것이다'), ('일곱'), ('일단'), ('일때'), ('일반적으로'), ('일지라도'), ('임에'), ('틀림없다'), ('입각하여'), ('입장에서'), ('잇따라'), ('자기'), ('자기집'), ('자마자'), ('자신'), ('잠깐'), ('잠시'), ('저것'), ('저것만큼'), ('저기'), ('저쪽'), ('저희'), ('전부'), ('전자'), ('전후'), ('점에서'), ('정도에'), ('제각기'), ('제외하고'), ('조금'), ('조차'), ('조차도'), ('졸졸'), ('좋아'), ('좍좍'), ('주룩주룩'), ('주저하지'), ('않고'), ('줄은'), ('몰랏다'), ('줄은모른다'), ('중에서'), ('중의하나'), ('즈음하여'), ('즉시'), ('지든지'), ('지만'), ('지말고'), ('진짜로'), ('쪽으로'), ('차라리'), ('참나'), ('첫번째로'), ('총적으로'), ('보면'), ('콸콸'), ('쾅쾅'), ('타다'), ('타인'), ('탕탕'), ('토하다'), ('통하여'), ('틈타'), ('펄렁'), ('하게될것이다'), ('하게하다'), ('하겠는가'), ('하고'), ('하고있었다'), ('하곤하였다'), ('하구나'), ('하기'), ('하기는한데'), ('하기만'), ('하면'), ('하기보다는'), ('하기에'), ('하나'), ('하느니'), ('하는'), ('김에'), ('편이'), ('낫다'), ('하는것도'), ('하는것만'), ('하는것이'), ('하는바'), ('하더라도'), ('하도다'), ('하도록시키다'), ('하도록하다'), ('하든지'), ('하려고하다'), ('하마터면'), ('할수록'), ('하면된다'), ('하면서'), ('하물며'), ('하여금'), ('하여야'), ('하자마자'), ('하지'), ('않는다면'), ('않도록'), ('하지마'), ('하지마라'), ('하지만'), ('하하'), ('이유는'), ('몰라도'), ('한데'), ('한마디'), ('한적이있다'), ('한켠으로는'), ('한항목'), ('따름이다'), ('생각이다'), ('안다'), ('지경이다'), ('힘이'), ('할때'), ('할만하다'), ('할망정'), ('할뿐'), ('할수있다'), ('할수있어'), ('할줄알다'), ('할지라도'), ('할지언정'), ('함께'), ('해도된다'), ('해도좋다'), ('해봐요'), ('해서는'), ('해야한다'), ('해요'), ('했어요'), ('향하다'), ('향하여'), ('향해서'), ('허걱'), ('허허'), ('헉헉'), ('헐떡헐떡'), ('형식으로'), ('쓰여'), ('혹시'), ('혹은'), ('혼자'), ('훨씬'), ('휘익'), ('흐흐'), ('힘입어');

select * from StopWord;

CREATE TABLE Notice(
  id int unsigned not null auto_increment Primary Key,
  createdate timestamp not null default CURRENT_TIMESTAMP comment '작성일',
  workdate timestamp not null default CURRENT_TIMESTAMP
           on Update CURRENT_TIMESTAMP comment '수정일',
  title varchar(255) not null comment '제목',
  writer int unsigned null comment '작성자',
  contents text null comment '내용'
);

ALTER TABLE Notice ADD CONSTRAINT fk_Notice_writer
  FOREIGN KEY (writer) REFERENCES Emp(id) ON DELETE SET NULL;

create fulltext index ft_idx_Notice_title_contents on Notice (title, contents);

-- 0 row(s) affected, 1 warning(s): 124 
-- InnoDB rebuilding table to add column FTS_DOC_ID Records: 0  Duplicates: 0  Warnings: 1

select * from Notice;

insert into Notice(title, contents) values
 ('세종대왕', '조선의 제4대 국왕이다.'),
 ('단군', '단군왕검(檀君王儉)은 한민족의 시조이자 고조선(古朝鮮)의 국조(國祖), 대종교의 시작.'),
 ('정약용', '조선 후기의 문신이자 실학자·저술가·시인·철학자·과학자·공학자이다.'),
 ('계백', '백제 말기의 군인이다.'),
 ('이순신', '조선 중기의 무신이었다. 본관은 덕수(德水), 자는 여해(汝諧), 시호는 충무(忠武).'),
 ('김유신', '신라의 화랑의 우두머리였으며 태대각간(太大角干)이었고 신라에 귀순한 가야 왕족의 후손.');

-- explain 
select * from Notice where contents like '%조선%';

explain select * from Notice where match(title, contents) against('조선');

show variables like 'innodb_ft_aux%';

set global innodb_ft_aux_table = 'testdb/Notice'; 

SET GLOBAL innodb_optimize_fulltext_only = ON;
OPTIMIZE TABLE testdb.Notice;
SET GLOBAL innodb_optimize_fulltext_only = OFF;

select * from information_schema.innodb_ft_index_table;

select * from Notice where match(title, contents) against('조선*' IN boolean mode);
select * from Notice where match(title, contents) against('*조선*' IN boolean mode);

select * from Notice where match(title, contents) against('이순신' IN boolean mode);
select * from Notice where contents like concat('%', '본관', '%');
select * from Notice where match(title, contents) against('이순신 +본관*' IN boolean mode);

select * from Notice where match(title, contents) against('고조선 조선*' IN boolean mode);
select * from Notice where match(title, contents) against('고조선 조선* -이순신' IN boolean mode);

select * from Notice where match(title, contents) against(concat('고조선', '*') IN boolean mode);

-- ex1) 문신과 무신 모두 출력하시오.
select * from Notice where match(title, contents) against('문신* 무신*' IN boolean mode);

-- ex2) 문신과 무신 중 후기 인물은 제외하시오.
select * from Notice where match(title, contents) against('문신* 무신* -후기*' IN boolean mode);

-- ex3) 문신과 무신 중 중기 인물만 출력하시오.
select * from Notice where match(title, contents) against('문신* 무신* +중기*' IN boolean mode);

select count(*), count(1), avg(case when id % 2 = 1 then 1 else ~0 end) from Emp;

-- create table TestEmp AS select * from Emp;
create table TestEmp like Emp;
show create table TestEmp;

insert into TestEmp select * from Emp;
select * from TestEmp;

alter table TestEmp partition by range(id) (
    partition p1 values less than(100),
    partition p2 values less than(200),
    partition p3 values less than MAXVALUE
);

select * from TestEmp where id = 200;

alter table TestEmp drop partition p2;
insert into TestEmp(id, ename, dept, salary) values(150, '김찬라', 1, 200);
explain select * from TestEmp where id = 150;

alter table TestEmp reorganize partition p3 into (
    partition p3 values less than(200),
    partition p4 values less than MAXVALUE
);

show index from TestEmp;
show table status like '%Emp%';

select * from INFORMATION_SCHEMA.LIBRARIES;

